command edad is unrecognized
r(199);

. asdoc ttest edad, by(tratamiento) append

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      97    14.23711    .1284098     1.26469    13.98222      14.492
       1 |     101    14.20792    .1204914    1.210924    13.96887    14.44697
---------+--------------------------------------------------------------------
Combined |     198    14.22222    .0877315    1.234492    14.04921    14.39524
---------+--------------------------------------------------------------------
    diff |            .0291926    .1759337               -.3177734    .3761586
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1659
H0: diff = 0                                     Degrees of freedom =      196

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5658         Pr(|T| > |t|) = 0.8684          Pr(T > t) = 0.4342

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
edad by tratamiento    |                                                                                        
                   0 1 |        97        101     14.237     14.208       .029       .176        .15      .8685 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
edad by tr~o |                                                                                        
         0 1 |        97        101     14.237     14.208       .029       .176        .15      .8685 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "edad by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "append", "", "",
>  "," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
- set trace off
Click to Open File:  Myfile.doc

. asdoc ttest hindu_padre, by(tratamiento) append

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      97    .4845361    .0510066     .502357    .3832887    .5857834
       1 |     101    .4653465    .0498798    .5012855    .3663865    .5643066
---------+--------------------------------------------------------------------
Combined |     198    .4747475    .0355781    .5006277    .4045847    .5449102
---------+--------------------------------------------------------------------
    diff |            .0191895    .0713388               -.1215007    .1598798
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.2690
H0: diff = 0                                     Degrees of freedom =      196

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6059         Pr(|T| > |t|) = 0.7882          Pr(T > t) = 0.3941

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
hindu_padre by trata~o |                                                                                        
                   0 1 |        97        101      .4845      .4655       .019      .0715        .25       .788 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
hindu_padr~o |                                                                                        
         0 1 |        97        101      .4845      .4655       .019      .0715        .25       .788 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "hindu_padre by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "append", 
> "", "", "," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
- set trace off
Click to Open File:  Myfile.doc

. clear a単単
a単単 not allowed
r(198);

. clear all

. cd "C:\Users\docha\OneDrive\Escritorio\R\Taller-HE1", replace
invalid syntax
r(198);

. use "he1-taller-datos-baselinesurvey.dta", replace

. asdoc ttest edumadre, by(tratamiento) replace

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      92    2.913043    .4183592     4.01276    2.082024    3.744063
       1 |      98    2.479592    .3843755    3.805123    1.716713    3.242471
---------+--------------------------------------------------------------------
Combined |     190    2.689474     .283132    3.902705    2.130969    3.247978
---------+--------------------------------------------------------------------
    diff |            .4334516     .567171               -.6853853    1.552289
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.7642
H0: diff = 0                                     Degrees of freedom =      188

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7772         Pr(|T| > |t|) = 0.4457          Pr(T > t) = 0.2228

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
edumadre by tratamie~o |                                                                                        
                   0 1 |        92         98      2.913     2.4795      .4335       .567        .75      .4455 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
edumadre b~o |                                                                                        
         0 1 |        92         98      2.913     2.4795      .4335       .567        .75      .4455 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "edumadre by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "", "", "", "
> ," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
(file Myfile.doc not found)
- set trace off
Click to Open File:  Myfile.doc

. asdoc ttest edupadre, by(tratamiento) append

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      92    5.173913    .5028843    4.823497    4.174995    6.172831
       1 |      98    6.020408    .4632462    4.585903    5.100993    6.939824
---------+--------------------------------------------------------------------
Combined |     190    5.610526    .3416335    4.709092    4.936622    6.284431
---------+--------------------------------------------------------------------
    diff |           -.8464951    .6826375               -2.193109    .5001185
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.2400
H0: diff = 0                                     Degrees of freedom =      188

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1083         Pr(|T| > |t|) = 0.2165          Pr(T > t) = 0.8917

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
edupadre by tratamie~o |                                                                                        
                   0 1 |        92         98      5.174     6.0205     -.8465      .6825      -1.25      .2165 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
edupadre b~o |                                                                                        
         0 1 |        92         98      5.174     6.0205     -.8465      .6825      -1.25      .2165 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "edupadre by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "append", "",
>  "", "," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
- set trace off
Click to Open File:  Myfile.doc

. asdoc ttest ingreso, by(tratamiento) append

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      92    2.597826    .1714583     1.64457    2.257245    2.938407
       1 |      98     2.44898    .1563055    1.547345    2.138756    2.759203
---------+--------------------------------------------------------------------
Combined |     190    2.521053    .1155443    1.592668    2.293131    2.748975
---------+--------------------------------------------------------------------
    diff |            .1488465    .2315636               -.3079505    .6056435
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.6428
H0: diff = 0                                     Degrees of freedom =      188

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7394         Pr(|T| > |t|) = 0.5211          Pr(T > t) = 0.2606

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
ingreso by tratamiento |                                                                                        
                   0 1 |        92         98      2.598      2.449       .149      .2315        .65       .521 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
ingreso by~o |                                                                                        
         0 1 |        92         98      2.598      2.449       .149      .2315        .65       .521 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "ingreso by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "append", "", 
> "", "," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
- set trace off
Click to Open File:  Myfile.doc

. asdoc ttest edad, by(tratamiento) append

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      97    14.23711    .1284098     1.26469    13.98222      14.492
       1 |     101    14.20792    .1204914    1.210924    13.96887    14.44697
---------+--------------------------------------------------------------------
Combined |     198    14.22222    .0877315    1.234492    14.04921    14.39524
---------+--------------------------------------------------------------------
    diff |            .0291926    .1759337               -.3177734    .3761586
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1659
H0: diff = 0                                     Degrees of freedom =      196

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5658         Pr(|T| > |t|) = 0.8684          Pr(T > t) = 0.4342

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
edad by tratamiento    |                                                                                        
                   0 1 |        97        101     14.237     14.208       .029       .176        .15      .8685 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
edad by tr~o |                                                                                        
         0 1 |        97        101     14.237     14.208       .029       .176        .15      .8685 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "edad by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "append", "", "",
>  "," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
- set trace off
Click to Open File:  Myfile.doc

. asdoc ttest hindu_padre, by(tratamiento) append

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      97    .4845361    .0510066     .502357    .3832887    .5857834
       1 |     101    .4653465    .0498798    .5012855    .3663865    .5643066
---------+--------------------------------------------------------------------
Combined |     198    .4747475    .0355781    .5006277    .4045847    .5449102
---------+--------------------------------------------------------------------
    diff |            .0191895    .0713388               -.1215007    .1598798
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.2690
H0: diff = 0                                     Degrees of freedom =      196

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6059         Pr(|T| > |t|) = 0.7882          Pr(T > t) = 0.3941

                    Two-sample t test with equal variances

----------------------------------------------------------------------------------------------------------------
                       |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-----------------------+----------------------------------------------------------------------------------------
hindu_padre by trata~o |                                                                                        
                   0 1 |        97        101      .4845      .4655       .019      .0715        .25       .788 
----------------------------------------------------------------------------------------------------------------

             |      obs1       obs2      Mean1      Mean2        dif     St_Err    t_value    p_value 
-------------+----------------------------------------------------------------------------------------
hindu_padr~o |                                                                                        
         0 1 |        97        101      .4845      .4655       .019      .0715        .25       .788 
- mata: asdoctable("`save'", "`r(colnames)'", "`r(rownames)'", "T", "`r(ttitle)'", `fs', `abb', "`append'", "`noheader'", "`rowappend'", "," ,`frs',"", "`dec'", "`cmd'", "`label'", "`tzok'", "`font'",
>  "`fhc'", "`fhr'", "`notes'", "`store'")
= mata: asdoctable("Myfile.doc", "obs1 , obs2 , Mean1 , Mean2 , dif , St_Err , t_value , p_value", "hindu_padre by tratamiento: 0 1,", "T", "Two-sample t test with equal variances", 20, 20, "append", 
> "", "", "," ,1400,"", "3", "", "", "", "Garamond", "", "", "", "")
- set trace off
Click to Open File:  Myfile.doc

. exit, clear
